---
type: CompoundStructureLayer
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CompoundStructureLayer

`Autodesk.Revit.DB.CompoundStructureLayer` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CompoundStructureLayer | — | `` |
| Constructor | CompoundStructureLayer | — | `public CompoundStructureLayer ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | DeckEmbeddingType | — | `public StructDeckEmbeddingType DeckEmbeddingType { get ; set ; }` |
| Property | DeckProfileId | — | `public ElementId DeckProfileId { get ; set ; }` |
| Property | Function | — | `public MaterialFunctionAssignment Function { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | LayerCapFlag | — | `public bool LayerCapFlag { get ; set ; }` |
| Property | LayerId | — | `public int LayerId { get ; }` |
| Property | MaterialId | — | `public ElementId MaterialId { get ; set ; }` |
| Property | Width | — | `public double Width { get ; set ; }` |